[
    {
      "id":0,
      "name":"Germany",
      "images":"./assets/germ_",
      "map":"./assets/map_germany.png",
      "history":"Germany's history is a tapestry of triumphs, turmoil, and transformation. The land that is now Germany has been a crossroads of cultures for thousands of years, from ancient Germanic tribes to the powerful Holy Roman Empire, the unification of Germany, two world wars, and its modern role as a global leader. The earliest inhabitants of Germany were Celtic and Germanic tribes, with the latter playing a key role in resisting Roman expansion. In the 5th century AD, Germanic groups like the Goths and Vandals contributed to the fall of the Western Roman Empire. By 800 AD, Charlemagne, King of the Franks, unified much of Western Europe under the Holy Roman Empire, a structure that dominated central Europe for nearly a thousand years. The empire was a patchwork of small states, ruled by princes, kings, and bishops. It survived wars, reforms, and divisions until Napoleon Bonaparte dissolved it in 1806. The Congress of Vienna (1815) attempted to restore order, but German nationalism was growing, fueled by ideas of unity and self-rule. The 19th century saw Prussia rise as a dominant force, leading to the unification of Germany in 1871 under Chancellor Otto von Bismarck. The German Empire, led by Kaiser Wilhelm I, became an economic and military powerhouse. However, tensions with European rivals led to World War I (1914–1918), which ended in Germany’s defeat and the Treaty of Versailles, imposing harsh reparations and economic struggles. The interwar period was marked by the rise of the Nazi Party. Adolf Hitler became Chancellor in 1933, and by 1939, Germany had launched World War II, seeking territorial expansion. The war devastated Europe and ended with Germany’s surrender in 1945. After the war, Germany was divided into West Germany (Federal Republic of Germany) and East Germany (German Democratic Republic), with the Berlin Wall physically and ideologically splitting the country. The Cold War defined German politics until the wall fell in 1989, symbolizing the end of communist rule in Eastern Europe. Germany reunified in 1990, and since then, it has emerged as one of the world’s strongest economies and a pillar of European unity.",
      "geography":"Germany, located in the heart of Europe, boasts a diverse landscape that ranges from rugged mountains to vast plains and picturesque river valleys. Covering approximately 357,000 square kilometers (137,000 square miles), it shares borders with nine countries: Denmark, Poland, the Czech Republic, Austria, Switzerland, France, Luxembourg, Belgium, and the Netherlands. Southern Germany is dominated by the Bavarian Alps, where the Zugspitze, Germany’s highest peak (2,962 meters or 9,718 feet), offers stunning alpine scenery. The Black Forest, a dense, fairy-tale-like woodland in the southwest, is famous for its traditional cuckoo clocks and charming villages. Germany’s major rivers include the Rhine, which serves as a vital trade route, the Danube, which starts in the Black Forest and flows through multiple European countries, and the Elbe, winding through cities like Hamburg and Dresden. The North and Baltic Seas define the country's northern borders, with stunning coastlines and islands like Sylt and Rügen. Germany has a temperate climate, with warm summers and cold winters. The north experiences oceanic influences, leading to milder winters, while the south, especially near the Alps, gets colder temperatures and heavy snowfall in winter. The country’s geographical variety not only shapes its natural beauty but also influences local cultures, cuisines, and traditions, making each region distinct.",
      "holidays":"Germany is known for its deep-rooted traditions and numerous holidays, many of which reflect its religious, historical, and cultural heritage. As a predominantly Christian country, Germany observes Christmas (Weihnachten) with grand celebrations. The Christmas markets, or Weihnachtsmärkte, are famous worldwide for their festive lights, mulled wine (Glühwein), and handcrafted gifts. Easter (Ostern) is another major holiday, featuring egg hunts, festive meals, and religious processions. One of the most significant public holidays is German Unity Day (Tag der Deutschen Einheit) on October 3rd, commemorating the 1990 reunification of East and West Germany. Other notable public holidays include Labour Day (May 1st) and Ascension Day (Christi Himmelfahrt), which doubles as Father’s Day in Germany. No discussion of German holidays is complete without Oktoberfest—the world’s largest beer festival, held annually in Munich. Originally a royal wedding celebration in 1810, it has grown into a 16-day event with traditional Bavarian attire, folk music, and endless beer. Karneval (or Fasching) is another lively festival, particularly in cities like Cologne, Düsseldorf, and Mainz, featuring parades, costumes, and street parties. Germany’s holidays reflect a balance between solemn historical commemorations, religious traditions, and joyous cultural festivities.",
      "travel": "Germany is a top European travel destination, offering a mix of historical landmarks, cultural heritage, and stunning natural landscapes. Berlin, the capital, is filled with historical sites such as the Brandenburg Gate, Berlin Wall Memorial, and Reichstag Building. Munich is known for its charming old town, Marienplatz, and Neuschwanstein Castle, the real-life inspiration for Disney’s Cinderella castle. The Romantic Road in Bavaria leads travelers through medieval towns like Rothenburg ob der Tauber, with its half-timbered houses and cobblestone streets. Germany is home to some of the world’s finest museums, such as the Pergamon Museum in Berlin, the Dachau Concentration Camp Memorial near Munich, and the Bauhaus Museum in Weimar. The Black Forest and Bavarian Alps offer breathtaking hiking trails and skiing resorts. The Rhine Valley is famous for its vineyard-covered hills, river cruises, and fairytale-like castles.Germany’s diversity makes it a must-visit destination for history lovers, adventure seekers, and cultural explorers alike."
    },
    {
      "id":1,
      "name":"The Netherlands",
      "images":"./assets/neth-",
      "map":"./assets/the_nether_map.png",
      "history":"The history of The Netherlands is a story of resilience, trade, and innovation. Once a collection of provinces under the rule of foreign powers, the country evolved into a global economic powerhouse and a center for culture and diplomacy. The roots of Dutch civilization trace back to ancient times when the region was inhabited by Germanic and Celtic tribes. However, the Roman Empire's expansion into the Low Countries in the first century BCE left a significant mark on its early development. After the fall of Rome, the area became part of the Holy Roman Empire, with various local rulers maintaining control over fragmented provinces. The Netherlands' defining moment came in the 16th century with the rise of Protestantism and opposition to Spanish Catholic rule under King Philip II. The Eighty Years' War (1568–1648) saw Dutch rebels, led by William of Orange, fighting for independence. The Treaty of Westphalia in 1648 officially recognized The Netherlands as an independent republic, marking the beginning of its Golden Age. During the 17th century, the Dutch Republic became one of the world’s leading maritime and economic powers. Cities like Amsterdam, Rotterdam, and The Hague flourished as centers of trade, banking, and culture. The Dutch East India Company (VOC) and the Dutch West India Company established extensive global trading networks, bringing immense wealth to the country. The 18th and 19th centuries saw wars with Britain and France, leading to periods of decline and foreign occupation, particularly under Napoleon. However, the creation of the Kingdom of the Netherlands in 1815 unified the country under King William I. The 20th century brought further challenges, including World War II, when Nazi Germany occupied the country, leading to tragic events such as the Holocaust and the story of Anne Frank. After the war, The Netherlands rapidly rebuilt and became a founding member of the European Union and NATO, helping to shape modern Europe. Today, The Netherlands is known for its strong democracy, liberal values, and a thriving economy rooted in innovation, trade, and sustainability.",
      "geography":"The Netherlands is a small but geographically unique country located in Western Europe, bordered by Germany to the east, Belgium to the south, and the North Sea to the west and north. With an area of about 41,500 square kilometers, it is one of the most densely populated countries in the world.A defining feature of Dutch geography is that about one-third of the country lies below sea level. To combat flooding, the Dutch have developed an extensive system of dikes, canals, and water management technologies. The famous Delta Works is a series of barriers, dams, and sluices designed to protect the country from storm surges and rising sea levels. The country is remarkably flat, with the highest point, Vaalserberg, standing at only 322 meters above sea level. This flat terrain has made cycling an essential mode of transport, with an estimated 23 million bicycles in a country of 17.5 million people. The Rhine, Meuse, and Scheldt Rivers flow through The Netherlands, contributing to its extensive canal network. These waterways have played a crucial role in the country’s economic success, making ports like Rotterdam (Europe’s largest port) vital global trade hubs.Despite its small size, The Netherlands boasts a variety of landscapes, from the sandy dunes along the North Sea coast to the lush green fields of Holland and the picturesque windmills of Kinderdijk. The country’s mild maritime climate brings cool summers and mild winters, making it an ideal place for both agriculture and outdoor activities.",
      "holidays":"Dutch holidays reflect a blend of history, culture, and modern traditions. Some of the most celebrated holidays include: One of the most famous Dutch holidays, King’s Day is a nationwide celebration of the reigning monarch's birthday. Cities and towns are flooded with people dressed in orange, participating in street parties, flea markets, and boat parades. Amsterdam, in particular, becomes a sea of orange-clad revelers celebrating with music, drinks, and festivities. The Dutch version of Santa Claus, Sinterklaas, arrives from Spain in mid-November and is celebrated on December 5. Children leave their shoes out, hoping for gifts from Sinterklaas, who is accompanied by his helpers, the Pieten. Families exchange presents and read humorous poems about each other. This holiday marks the end of World War II in The Netherlands, celebrating freedom and democracy. Large music festivals, parades, and speeches take place, with a special focus on honoring veterans. Celebrated mainly in the Catholic provinces of Brabant and Limburg, Carnaval is a lively festival with parades, costumes, and wild street parties, similar to the famous celebrations in Brazil and Germany. The Dutch celebrate Christmas (Kerstmis) with family gatherings, elaborate meals, and Gourmetten, a fondue-like tradition. New Year's Eve (Oudejaarsavond) is known for spectacular fireworks displays, particularly in The Hague and Rotterdam.",
      "travel": "The Netherlands is a top European tourist destination, famous for its historic cities, tulip fields, windmills, and vibrant cultural scene. The capital city, Amsterdam, is world-famous for its canal network, historic buildings, and world-class museums. Visitors flock to the Rijksmuseum, Van Gogh Museum, and Anne Frank House, while the Jordaan district offers charming streets lined with cafés and boutiques. Every spring, the Keukenhof Gardens burst into bloom with millions of colorful tulips. Located in Lisse, this breathtaking floral display attracts tourists from around the world. For a taste of traditional Dutch life, visitors head to Kinderdijk, where 19 historic windmills stand against a picturesque backdrop. Zaanse Schans, near Amsterdam, is another must-see with wooden houses, cheese-making demonstrations, and working windmills. Unlike other Dutch cities, Rotterdam is known for its modern skyline, cutting-edge architecture, and Europe’s largest port. Attractions include the Erasmus Bridge, Markthal, and Cube Houses. The Hague (Den Haag) is home to the Dutch government, the International Court of Justice, and the Mauritshuis Museum, which houses Vermeer’s 'Girl with a Pearl Earring.' The Netherlands offers stunning North Sea beaches in Scheveningen and Texel Island. The Dutch cycling routes, including the Hoge Veluwe National Park, provide breathtaking landscapes and a peaceful escape from urban life."
    },
    {
      "id":2,
      "name":"France",
      "images":"./assets/france-",
      "map":"./assets/france-map.png",
      "history":"The history of France is one of kings and revolutions, artistic triumphs, and global influence. From ancient times to modern leadership in Europe, France has shaped the world politically, culturally, and intellectually. The region now known as France was originally inhabited by Celtic Gauls, who were conquered by Julius Caesar's Roman forces in 52 BCE, turning Gaul into a prosperous province of the Roman Empire. After the fall of Rome, the Franks, a Germanic tribe, took control, and their greatest ruler, Charlemagne, expanded the Frankish Empire across much of Europe in the 8th and 9th centuries. The medieval period saw the rise of the Capetian dynasty, which consolidated power and established France as a strong kingdom. The Hundred Years’ War (1337–1453) between France and England shaped national identity, especially with the heroic efforts of Joan of Arc, who helped drive the English out before being executed. The 16th and 17th centuries were defined by the grandeur of absolute monarchy, reaching its peak under King Louis XIV (1643–1715), known as the 'Sun King.' His extravagant Palace of Versailles symbolized France’s power. However, economic hardship and growing unrest led to the French Revolution in 1789, a turning point in world history that ended monarchy and established democracy with the Declaration of the Rights of Man and of the Citizen. The revolution’s chaos led to the rise of Napoleon Bonaparte, who crowned himself Emperor in 1804 and expanded French influence across Europe before his defeat at Waterloo in 1815. The 19th and early 20th centuries saw alternating periods of monarchy and republic, culminating in World War I and World War II. France suffered greatly under German occupation (1940–1944) but emerged as a major force in rebuilding Europe. Charles de Gaulle led post-war France, modernizing its institutions and establishing the Fifth Republic in 1958, which still governs today. France has since played a leading role in the European Union, global diplomacy, and cultural movements, remaining a beacon of art, fashion, and political thought.",
      "geography":"France is the largest country in Western Europe, covering 551,695 km², and is often called ' L'Hexagone ' due to its six-sided shape. Its diverse landscapes range from rugged mountains to golden beaches, fertile farmlands, and dense forests. To the north, France shares borders with Belgium and Luxembourg, while the east meets Germany, Switzerland, and Italy. To the south, it borders Spain and Andorra, with the Mediterranean Sea providing stunning coastlines, including the glamorous French Riviera. The western coastline, along the Atlantic Ocean, features historic ports like Bordeaux and La Rochelle. France is home to three major mountain ranges: The Alps, where Mont Blanc (4,809 m), the highest peak in Western Europe, stands. The Pyrenees, forming a natural border with Spain. The Massif Central, a volcanic highland in central France. The country is also crossed by several major rivers, including the Seine, which flows through Paris, the Loire, known for its châteaux, the Rhône, and the Garonne. Its climate varies from oceanic in the west, with mild winters and cool summers, to a Mediterranean climate in the south, bringing warm, dry summers. The Alpine regions experience heavy snowfall, making France a premier skiing destination. Beyond mainland France, overseas territories like Guadeloupe, Réunion, and French Polynesia contribute to its global presence, adding tropical landscapes to its rich geography.",
      "holidays":"French holidays reflect the country’s revolutionary spirit, Catholic traditions, and festive culture. The most iconic French holiday, Bastille Day, commemorates the storming of the Bastille prison in 1789, a key event of the French Revolution. The day is marked by military parades, fireworks, and street parties, with Paris hosting a grand celebration along the Champs-Élysées. Christmas in France is a magical time, with Christmas markets in Strasbourg and Alsace among the oldest in Europe. Families enjoy Le Réveillon, a lavish meal featuring oysters, foie gras, and Bûche de Noël (Yule log cake). New Year’s Eve, known as Saint-Sylvestre, is celebrated with champagne, feasts, and fireworks. A major Christian holiday, Easter in France is known for chocolate bells ('Cloches de Pâques') instead of the Easter Bunny. Many families attend church and enjoy festive meals. A day dedicated to workers' rights, Labor Day is also marked by the tradition of gifting lily-of-the-valley flowers (muguet) as a symbol of good luck. Commemorating the end of World War I in 1918, this day honors fallen soldiers with ceremonies at the Arc de Triomphe and across France.",
      "travel": "France is the most visited country in the world, welcoming over 80 million tourists annually. From historic landmarks to stunning landscapes, France offers endless experiences. No trip to France is complete without exploring Paris, home to world-famous sites like the Eiffel Tower, Louvre Museum, Notre-Dame Cathedral, and the Champs-Élysées. The city’s cafés, art galleries, and charming neighborhoods, like Montmartre, make it a dream destination. The French Riviera is synonymous with luxury. Cities like Nice, Cannes, and Monaco attract celebrities and tourists with their beautiful beaches, film festivals, and exclusive resorts. Often called the 'Garden of France,' the Loire Valley is famous for its fairytale châteaux, including Château de Chambord and Château de Chenonceau. The Provence region is famous for its lavender fields, vineyards, and Roman amphitheaters in cities like Arles and Avignon. This breathtaking island monastery in Normandy appears to rise from the sea, making it one of the most awe-inspiring sights in France. For ski lovers, resorts like Chamonix and Courchevel offer world-class skiing, while summer brings breathtaking hiking trails. History enthusiasts visit the D-Day beaches where Allied forces landed in 1944, with museums and memorials honoring World War II heroes."
    },
    {
      "id":3,
      "name":"The Great Britain",
      "images":"./assets/brit-",
      "map":"./assets/uk_map.png",
      "history":"Great Britain’s history is one of conquest, empire, and innovation. Originally inhabited by Celtic tribes, the island saw Roman occupation (43–410 AD), followed by invasions from the Anglo-Saxons, Vikings, and Normans. The Norman Conquest of 1066, led by William the Conqueror, shaped medieval England. The Hundred Years’ War (1337–1453) with France and the Wars of the Roses (1455–1487) led to the rise of the Tudor dynasty, with Henry VIII’s creation of the Church of England. The Elizabethan era (1558–1603) saw England’s global expansion, including Sir Francis Drake's explorations and Shakespeare’s literary achievements. The 17th century brought civil war, the execution of King Charles I (1649), and the brief rule of Oliver Cromwell before the monarchy was restored. The Glorious Revolution (1688) limited royal power, paving the way for parliamentary democracy. During the 18th and 19th centuries, Great Britain became an industrial and colonial superpower, controlling vast territories across Asia, Africa, and the Americas. The Victorian era (1837–1901) saw the British Empire at its peak. The World Wars defined the 20th century, with Winston Churchill leading Britain in World War II. Post-war, Britain decolonized, joining the European Union in 1973, then leaving it in 2020 (Brexit). Today, it remains a leading economic and cultural force.",
      "geography":"Great Britain is the largest island in the British Isles and the ninth-largest island in the world. It is situated off the northwestern coast of mainland Europe and comprises three countries: England, Scotland, and Wales. The geography of Great Britain is diverse, featuring mountains, rolling hills, coastal cliffs, and fertile plains. Great Britain is located in the North Atlantic Ocean, separated from mainland Europe by the English Channel to the south and the North Sea to the east. To the west, it is bordered by the Irish Sea, which separates it from Ireland. The island has a coastline stretching over 12,429 km (7,723 miles), featuring numerous bays, estuaries, and inlets. The geography of Great Britain can be broadly divided into highland and lowland regions. The Scottish Highlands in the north are rugged and mountainous, home to Ben Nevis, the highest peak in the UK at 1,345 meters (4,413 feet).The Scottish Lowlands to the south are more fertile and densely populated, including cities like Glasgow and Edinburgh.",
      "holidays":"Christmas in Britain is a magical time with decorated streets, Christmas markets, and traditional British feasts featuring roast turkey, mince pies, and Christmas pudding. Families exchange gifts, and the Queen (or now King) gives a speech. Boxing Day, the day after Christmas, is a time for shopping, sports, and family outings. Known as Bonfire Night, this holiday commemorates the failed Gunpowder Plot of 1605, when Guy Fawkes tried to blow up the Parliament. The night is celebrated with fireworks, bonfires, and effigies of Guy Fawkes being burned. Easter is celebrated with church services, egg hunts, and hot cross buns. Many families also enjoy a roast lamb dinner. A solemn day to honor those who died in World War I and II. The nation observes a two-minute silence at 11 AM, and people wear red poppies as a symbol of remembrance. London has massive fireworks over the River Thames, while Scotland’s Hogmanay festival is even bigger, featuring torchlight processions, concerts, and street parties in Edinburgh.",
      "travel": "Tourism in the United Kingdom is a major industry and contributor to the U.K. economy, which is the world's 10th biggest tourist destination, with over 40.1 million visiting in 2019, contributing a total of £234 billion to the GDP. £23.1 billion was spent in the UK by foreign tourists in 2017. VisitBritain data shows that the USA remains the most valuable inbound market, with American visitors spending £2.1 billion in 2010. Nevertheless, the number of travellers originating from Europe is much larger than those travelling from North America: 21.5 million compared to 3.5 million American/Canadian visitors. After 9-year rise, as of 2019, United Kingdom attracting 40.86 million international tourists (Even before COVID-19 pandemic began (Between March 2020 and March 2022), which was more than two times U.K.'s total population. The country's principal tourist destinations are London, Edinburgh, Oxford, Cambridge, York, and Canterbury. The United Kingdom hosts a total of 33 World Heritage sites, the 8th most in the world.[6] The Lonely Planet travel guide voted England number 2, after Bhutan, as one of the best countries to visit in 2020.[7] Some of the most popular cities include London, Edinburgh and Manchester and notable attractions include the Palace of Westminster, the London Eye and Edinburgh Castle."
    },
    {
      "id":4,
      "name":"Canada",
      "images":"./assets/canada-",
      "map":"./assets/canada-map.png",
      "history":"Canada's history spans thousands of years, beginning with Indigenous nations like the Inuit, Métis, and First Nations. Vikings were the first Europeans to arrive, followed by French explorers (1534, Jacques Cartier) who claimed land for France. In 1763, Britain took control after the Seven Years’ War, leading to tensions between French and English populations. Canada became a dominion in 1867, uniting Ontario, Quebec, Nova Scotia, and New Brunswick. The 20th century saw Canada’s role in World Wars, economic expansion, and the 1965 adoption of its iconic maple leaf flag. In 1982, Canada gained full independence from Britain with the Constitution Act. Today, Canada is a multicultural nation known for its social policies, natural beauty, and global influence.",
      "geography":"Canada can be divided into seven physiographic regions: the Canadian Shield, the interior plains, the Great Lakes-St. Lawrence Lowlands, the Appalachian region, the Western Cordillera, Hudson Bay Lowlands and the Arctic Archipelago. Canada is also divided into fifteen terrestrial and five marine ecozones, encompassing over 80,000 classified species of life. Since the end of the last glacial period, Canada has consisted of eight distinct forest regions, including extensive boreal forest on the Canadian Shield; 42 percent of the land acreage of Canada is covered by forests (approximately 8 percent of the world's forested land), made up mostly of spruce, poplar and pine. Canada has over 2,000,000 lakes—563 greater than 100 km2 (39 sq mi)—which is more than any other country, containing much of the world's fresh water. There are also freshwater glaciers in the Canadian Rockies, the Coast Mountains and the Arctic Cordillera. A recent global remote sensing analysis also suggested that there were 6,477 km2 of tidal flats in Canada, making it the 5th ranked country in terms of how much tidal flat occurs there. Protected areas of Canada and National Wildlife Areas have been established to preserve ecosystems.",
      "holidays":"Public holidays in Canada, known as statutory holidays, consist of a variety of cultural, nationalistic, and religious holidays that are legislated in Canada at the federal or provincial and territorial levels. While many of these holidays are honoured and acknowledged nationwide, provincial and territorial legislation varies in regard to which are officially recognized. There are five nationwide statutory holidays and six additional holidays for federal employees. Each of the 13 provinces and territories observes a number of holidays in addition to the nationwide days, but each varies in regard to which are legislated as either statutory, optional, or not at all. Many public and private employers, as well as school systems, provide additional days off around the end of December, often including at least a full or half-day on December 24 (Christmas Eve) or December 31 (New Year's Eve) or in some cases, the entire week between Christmas and New Year. While not officially legislated in any capacity, internationally notable cultural holidays such as Valentine's Day, Saint Patrick's Day, Halloween, Mother's Day, and Father's Day are traditionally observed by Canadians as part of Canadian culture.",
      "travel":"Canada has a large domestic and foreign tourism industry. The second largest country in the world, Canada's wide geographical variety is a significant tourist attractor. Much of the country's tourism is centred in the following regions: Toronto, Montreal, Quebec City, Vancouver/Whistler, Niagara Falls, Vancouver Island, Canadian Rockies, British Columbia's Okanagan Valley, Churchill, Manitoba and the National Capital Region of Ottawa-Gatineau. The large cities are known for their culture, diversity, as well as the many national parks and historic sites. In 2023, non-Canadian visitors made 27.2 million trips to Canada, with U.S. residents contributing the most, accounting for 21.2 million of those trips. The total spending by tourists reached $12.9 billion for U.S. residents and $12.6 billion for overseas visitors. Domestic and international tourism combined directly contributes 1% of Canada's total GDP and supports 309,000 jobs in the country."
    },
    {
      "id":5,
      "name":"Japan",
      "images":"./assets/japan-",
      "map":"./assets/japan-map.png",
      "history":"Japan’s history begins with the Jomon period (14,000 BC), followed by the Yamato state in the 3rd century. The Heian period (794-1185) saw the rise of Japanese culture, literature, and samurai warriors. The feudal era (1185-1600) was dominated by samurai and shoguns, including Oda Nobunaga and Tokugawa Ieyasu, who unified Japan. The Edo period (1603-1868) brought peace and isolation. In 1868, the Meiji Restoration modernized Japan, leading to industrialization. Japan became an empire, expanding in Asia until World War II, ending with its defeat in 1945 after atomic bombings. Post-war, Japan became an economic powerhouse, famous for technology, anime, and its cultural blend of tradition and modernity.",
      "geography":"Japan is an archipelago, or string of islands, on the eastern edge of Asia. There are four main islands: Hokkaido, Honshu, Shikoku, and Kyushu. There are also nearly 4,000 smaller islands! Japan's nearest mainland neighbors are the Siberian region of Russia in the north and Korea and China farther south. Almost four-fifths of Japan is covered with mountains. The Japanese Alps run down the center of the largest island, Honshu. The highest peak is Mount Fuji, a cone-shaped volcano considered sacred by many Japanese. Japan can be a dangerous place. Three of the tectonic plates that form Earth's crust meet nearby and often move against each other, causing earthquakes. More than a thousand earthquakes hit Japan every year. Japan also has about 200 volcanoes, 60 of which are active.",
      "holidays":"New Year (Oshogatsu, January 1-3): The biggest holiday in Japan, where families visit shrines for Hatsumode (first prayers of the year), eat special dishes like Osechi Ryori, and watch the first sunrise of the year (Hatsu-Hinode). Cherry Blossom Festival (Hanami, March-April): Families and friends gather under sakura trees to enjoy picnics and sake. Golden Week (April 29 - May 5): A series of holidays including Showa Day, Constitution Day, Greenery Day, and Children’s Day. It’s one of the busiest travel periods in Japan. Obon Festival (August 13-16): Honors deceased ancestors. People light lanterns, visit family graves, and enjoy Bon Odori (dancing festivals). Tanabata (Star Festival, July 7): Based on an old romantic legend, people write wishes on colorful paper strips and hang them on bamboo trees.",
      "travel": "Tourism in Japan is a major industry and contributor to the Japanese economy. In 2019, the sector directly contributed 11 trillion yen (US$100 billion), or 2% of the GDP, and attracted 31.88 million international tourists.[1][2][3] In 2024, 36,9 million international tourists visited Japan. There are 26 World Heritage Sites in Japan, including Himeji Castle, Historic Monuments of Ancient Kyoto and Nara. Popular attractions for foreigners include Tokyo and Osaka, Mount Fuji, Kyoto, Hiroshima, Nagasaki, ski resorts such as Niseko in Hokkaido, Okinawa, riding the Shinkansen and taking advantage of Japan's hotel and hotspring network. The 2024 Travel and Tourism Competitiveness Report ranked Japan 3rd out of 141 countries overall, which was the highest in Asia. Japan gained relatively high scores in almost all of the featured aspects, such as health and hygiene, safety and security, cultural resources and business travel."
    }
]